Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F41B.tmx
Source language: en_us
Languages: zh_cn

source: HISTORY OF LANGUAGE
zh_cn: 语言的历史

source: Words on the brain: from 1 million years ago?
zh_cn: 大脑中的词语：起自1百万年前？

source: All social animals communicate with each other, from bees and ants to whales and apes, but only humans have developed a language which is more than a set of prearranged signals.
zh_cn: 从蜜蜂和蚂蚁到鲸和猿，所有群居动物都会彼此交流，但只有人类进化出了语言，而不仅仅只是一组预设的信号。

source: Our speech even differs in a physical way from the communication of other animals.
zh_cn: 我们的语言甚至从生理上就有别于其他动物间的交流方式。

source: It comes from a cortical speech centre which does not respond instinctively, but organises sound and meaning on a rational basis.
zh_cn: 它由大脑皮层的语言中枢基于对声音和含义的合理组织产生，而非本能的条件反射。

source: This section of the brain is unique to humans.
zh_cn: 只有人类具有这样的脑组织。

source: When and how the special talent of language developed is impossible to say.
zh_cn: 没人能说清语言的天赋是从何时以及如何发展起来的。

source: But it is generally assumed that its evolution must have been a long process.
zh_cn: 但普通推断语言的进化一定经历了漫长的过程。

source: Our ancestors were probably speaking a million years ago, but with a slower delivery, a smaller vocabulary and above all a simpler grammar than we are accustomed to.
zh_cn: 我们的祖先很可能1百万年前就会说话了，但相比于现在我们的习惯，当时的语速更慢，词汇更少，尤其是语法更简单。

source: Origins of language
zh_cn: 语言的起源

source: The origins of human language will perhaps remain for ever obscure.
zh_cn: 人类语言的起源也许将会永远扑朔迷离。

source: By contrast the origin of individual languages has been the subject of very precise study over the past two centuries.
zh_cn: 相比之下每种单独语言的起源在过去的2个世纪间一直被作为准确研究的主题。

source: There are about 5000 languages spoken in the world today (a third of them in Africa), but scholars group them together into relatively few families - probably less than twenty.
zh_cn: 今天，全世界大约有5000种语言被使用（其中1/3在非洲），学者们将它们分为相应的几个家族——大概不超过20个。

source: Languages are linked to each other by shared words or sounds or grammatical constructions.
zh_cn: 不同语言间通过共享单词或发音或语法结构彼此关联。

source: The theory is that the members of each linguistic group have descended from one language, a common ancestor.
zh_cn: 理论认为每种语系的成员们都源自于一个语言，享有一个共同的祖先。

source: In many cases that original language is judged by the experts to have been spoken in surprisingly recent times - as little as a few thousand years ago.
zh_cn: 很多情况下，专家们认为这种作为起源的语言产生的年代超乎想像得近——顶多是几千年以前。

source: Linguistic groups: from 3000 BC
zh_cn: 语系：起自公元前3000年

source: The most widespread group of languages today is the Indo-European, spoken by half the world's population.
zh_cn: 印欧语系是如今最为广泛流传的语系，全世界一半人口都在使用它。

source: This entire group, ranging from Hindi and Persian to Norwegian and English, is believed to descend from the language of a tribe of nomads roaming the plains of eastern Europe and western Asia (in modern terms centring on the Ukraine) as recently as about 3000 BC.
zh_cn: 该语系涵盖了从印地语和波斯语到挪威语和英语，被认为是源自于公元前3000年一个游走于东欧和西亚平原（当今以乌克兰为中心）的游牧部落的语言。

source: From about 2000 BC people speaking Indo-European languages begin to spread through Europe, eventually reaching the Atlantic coast and the northern shores of the Mediterranean.
zh_cn: 从公元前2000年起，使用印欧语言的人们开始散布整个欧洲，并最终到达大西洋沿岸以及地中海北岸。

source: They also penetrate far into Asia - occupying the Iranian plateau and much of India.
zh_cn: 他们还深入亚洲腹地——占领了伊朗高原及印度的大片土地。

source: Another linguistic group, of significance in the early history of west Asia and still of great importance today, is the Semitic family of languages.
zh_cn: 另一个在西亚早期历史中举足轻重且今天依旧占有重要地位的语系是闪米特语系。

source: These also are believed to derive from the language of just one tribal group, possibly nomads in southern Arabia.
zh_cn: 闪米特语系同样被认为是起源于一个大概是南阿拉伯地区游牧部落群族的语言。

source: By about 3000 BC Semitic languages are spoken over a large tract of desert territory from southern Arabia to the north of Syria.
zh_cn: 到公元前3000年时，闪米特语系的语言被使用于南阿拉伯至北叙利亚的广裔的沙漠地区。

source: Several Semitic peoples play a prominent part in the early civilization of the region, from the Babylonians and Assyrians to the Hebrews and Phoenicians.
zh_cn: 从巴比伦人和亚述人到希伯来人和腓尼基人，一些闪米特语族在该地区的文明进程中扮演了突出角色。

source: And one Semitic language, Aramaic, becomes for a while the Lingua franca of the Middle East.
zh_cn: 闪米特语系中的一种语言，亚拉姆语，还一度成为中东的通用语言。

source: Language and race
zh_cn: 语言和种族

source: A shared linguistic family does not imply any racial link, though in modern times this distinction has often been blurred.
zh_cn: 共用语系并不代表任何种族联系，尽管在现代这二者之间的差别通常被混淆。

source: Within the Indo-European family, for example, there is a smaller Indo-Iranian group of languages, also known as Aryan, which are spoken from Persia to India.
zh_cn: 例如，在印欧语族中，包含一小组印度伊朗语系的语言，称为雅利安，被用于波斯到印度地区。

source: In keeping with a totally unfounded racist theory of the late 19th century, the Nazis chose the term Aryan to identify a blond master race.
zh_cn: 19世纪末为了与一项毫无根据的种族理论保持一致，纳粹将雅利安一词用来代表金发的高等人种。

source: Blond or not, the Aryans are essentially a linguistic rather than a genetic family.
zh_cn: 不管是否金发与否，雅利安从本质上讲指代的是一种语言而非一个遗传家族。

source: The same is true of the Semitic family, including two groups which have played a major part in human history - the Jews and the Arabs.
zh_cn: 同样的道理对于闪米特语族也一样，该族包含了在人类历史上扮演了重要角色的两大族群——犹太人和阿拉伯人。

source: Enclaves of language
zh_cn: 语言飞地

source: On a Linguistic map of the world, most of the great language families occupy one distinct and self-contained territory.
zh_cn: 在世界语言地图上，绝大多数壮大的语族都占有一片明确且独立的领土。

source: The two exceptions are the Indo-European and the Finno-Ugric groups.
zh_cn: 但印欧语族和芬兰-乌戈尔语族是两个例外。

source: In modern times the Indo-European languages have spread across the globe - to North and South America, Australia and New Zealand - as a result of European colonialism.
zh_cn: 当今印欧语族已经散布全球——北美洲和南美洲，澳大利亚和新西兰——伴随着欧洲殖民的脚步。

source: But the intermingling of Indo-European and Finno-Ugric, forming a patchwork quilt across Europe, has come about for a different and earlier reason.
zh_cn: 但印欧语系和芬兰-乌戈尔语系散布欧洲东拼西凑的融合则是由于另一个出现更早的原因。

source: Finland, together with Estonia on the opposite shore of the Baltic, forms one isolated pocket of the Finno-Ugric group (the Finno part).
zh_cn: 波罗的海隔岸的芬兰和爱沙尼亚组成了芬兰-乌戈尔语族中的一个独立部分（芬兰部分）。

source: Hungary is another (the Ugric element).
zh_cn: 匈牙利则是另一部分（乌戈尔部分）。

source: The cause of this wide separation is the great plateau of Europe which Finno-Ugric and Indo-European tribes have shared and fought over through the centuries.
zh_cn: 造成该巨大区别的原因是印欧语族部落和芬兰-乌戈尔语族部落共同占有欧洲大高原，并在过去的数百年间一直征战不断。

source: The ancestral language of the Finns, Estonians and Hungarians was once spoken in a compact region between the Baltic and the Ural mountains, until these people were scattered by Indo-European pressure.
zh_cn: 芬兰人、爱沙尼亚人和匈牙利人的祖先使用的语言曾一度集中在波罗的海和乌拉尔山脉之间的狭长地带，直到他们迫于印欧语族的压力而散落。

source: Latin and German: from the 5th century
zh_cn: 拉丁语和德语：起自公元5世纪

source: Over the course of history languages continually infiltrate each other, as words are spread by conquest, empire, trade, religion, technology or - in modern times - global entertainment.
zh_cn: 在历史进程中语言之间始终在相互渗透，正如词汇借助占领、君权、贸易、宗教、技术或者当今的全球娱乐而被四处传播。

source: A good surviving example of this process is the line in western Europe dividing the Romance languages (those deriving from a 'Roman' example) from the Germanic tongues.
zh_cn: 关于这一过程现存的一个好例子即西欧关于罗曼语系（源自罗马）和日尔曼语系的分界线。

source: The Romance family includes Italian, French, Spanish, Portuguese and Romanian (the result of a successful Roman campaign in the 2nd century AD).
zh_cn: 罗曼语系包含意大利语、法语、西班牙语、葡萄牙语和罗马尼亚语（公元2世纪罗马战役胜利的成果）。

source: The Germanic group is English, Dutch, Flemish, German, Danish, Norwegian, Swedish and Icelandic.
zh_cn: 日尔曼语系则有英语、荷兰语、佛兰德语、德语、丹麦语、挪威语、瑞典语和冰岛语。

source: This linguistic division exactly reflects the influence of the Roman empire.
zh_cn: 这个语系间的分隔准确地反映了罗马帝国造成的影响。

source: Italy, France and the peninsula of Spain were sufficiently stable regions in the Roman world to retain the influence of Latin after the collapse of the empire.
zh_cn: 意大利、法国和西班牙半岛在罗马时期是相当稳定的地区，因而在罗马帝国崩溃后依然保留了拉丁语的影响力。

source: The Germanic areas east and north of the Rhine were never fully brought under Roman control (the exact linguistic dividing line survives in modern Belgium, with its population speaking French in the south and Flemish in the north).
zh_cn: 而莱茵河东部和北部的日尔曼地区从未被罗马完全控制（确切的语言分界线存在于当今的比利时，其南部人口使用法语而北部人口使用佛兰德语）。

source: England was safely within the empire for three centuries.
zh_cn: 英格兰在罗马帝国中的稳固长达3个世纪。

source: But the Romanized Celts were not strong enough to resist the invading German tribes, the Angles and the Saxons.
zh_cn: 但罗马化的凯尔特人不足以抵御入侵的日尔曼部落、盎格鲁人和撒克逊人。

source: Their languages prevailed in the form of Anglo-Saxon.
zh_cn: 他们的语言以盎格鲁-撒克逊语的形式盛行。

source: Modern English occupies a middle position within the western European family of languages, with its vocabulary approximately half Germanic and half Romance in origin.
zh_cn: 现代英语在西欧的语言大家庭中占据了中间位置，它的词汇大约一半源自日尔曼语，另一半源自罗曼语。

source: The reason is not Britannia's relatively fragile position within the Roman empire.
zh_cn: 原因并非是在罗马帝国中大不列颠脆弱的地位。

source: The cause is more recent, in the Norman conquest.
zh_cn: 其原因发生的时间更晚，在诺曼第占领时期。

source: After seizing northwest France and adopting the local language, the Normans arrive in England with French as an essential part of their cultural baggage.
zh_cn: 当控制了法国北部并学会了当地语言后，诺曼第人来到英格兰，此时法语已经是他们文化中不可或缺的一部分。

source: Several centuries of rule by Norman aristocrats and bureaucrats bring Latin words back into the language of England through the medium of medieval French.
zh_cn: 诺曼第贵族和官僚几个世纪的统治将拉丁语单词以中世纪法语的形式重新带回到英格兰的语言中。

source: Linguistic evolution
zh_cn: 语言的进化

source: The ongoing struggle between languages is a process very similar to evolution.
zh_cn: 语言间的斗争是个与进化非常类似的过程。

source: A word, like a gene, will travel and prevail according to its usefulness.
zh_cn: 一个单词，就像一个基因一样，将因为它有用而传播和流行。

source: A word's fitness to survive may derive from being attached to a desirable new invention or substance, or simply from being an amusing or useful concept.
zh_cn: 一个单词适合生存可能因为它被用于表示一件广受欢迎的新发明或物品，或者就是简单地因为它代表了一个可笑或有用的概念。

source: 'Aspirin', coined in 1899 by its German inventor from the opening letters of Acetylirte Spirs?ure (acetylated spiraeic acid), immediately became an international word.
zh_cn: “Aspirin”（阿司匹林），1899年被它的德国发明者由德语的Acetylirte Spirs?ure（乙酰水杨酸，英语：acetylated spiraeic acid）一词组合而成，该词立马成了国际通用的单词。

source: In a less serious context 'snob', first given its present meaning in English in the mid-19th century, is now naturalized in a great many languages.
zh_cn: 用于非正式语境中的“snob”（势利眼）一词，19世纪中期才在英语中被赋予了如今的意义，而现在它已经融入了许多语言中。

source: As with evolution, the development of language is an irresistible force - though traditionalists invariably attempt to build barriers against change.
zh_cn: 如同进化一样，语言的发展也是一股势不可当的力量——虽然传统主义者总是试图阻碍变革。

source: The useful word 'hopefully' (long available to Germans as hoffentlich, and meaning 'it is to be hoped that') has in recent years been steamrollered into the English language by the public against howls of protest from the purists.
zh_cn: 一个有用的单词“hopefully”（有希望地、有前途地）（来自德语中很早就有的一词hoffentlich，意思是“它被希望是......）近年来借助公众的力量击败语言纯化论者抗议的嚎叫打入了英语。

source: On a grander scale, the French government from time to time legislates ineffectually against English words straying into French.
zh_cn: 在更大的范围内，法国政府不时立法禁止英语单词泊入法语，却收效甚微。

source: These are the hybrids described as franglais.
zh_cn: 这些混合词在法语中被称为“franglais”（英语外来语）。

source: A good example of their impertinence is the enticing notice on a tweed jacket seen in a Parisian shop window: Tr¨¨s snob, presque cad (very snob, almost cad).
zh_cn: 关于它们的不适宜有一个好例子：一家巴黎商店橱窗中的一件粗花呢夹克上有一个诱人的标牌写着“ Très snob, presque cad”（非常势利眼，几乎是无赖）。

source: Imperial tongues
zh_cn: 语言霸主

source: The French neurosis about being tainted by English (though the intrusion is trivial compared to the overwhelming effect of Norman French on English in the past) is linked to a wider aspect of the evolutionary struggle between languages.
zh_cn: 关于法语被英语污染的忧虑与语言间的进化斗争的一个更大的方面有关（虽然相对于过去诺曼第法语对于英语势不可挡的影响，这点干扰显得微不足道）。

source: A major advance for any language is to become a Lingua franca.
zh_cn: 对于任何语言，成为通用语言都是一项重大的进步。

source: Almost invariably the result of power and prestige, this status is achieved by French after the heyday of France's international influence under Louis XIV.
zh_cn: 而这几乎始终是权利和威望的产物，在路易十四统治时期，法国的世界影响力达到全盛，随后法语便赢得了通用语言的地位。

source: In more recent times English - first through the British empire, but more significantly through American world dominance in the 20th century - has replaced French in this role.
zh_cn: 而后来英语——首先通过大不列颠帝国，但更主要的是借助20世纪美国的全球霸主地位——取代了法语作为通用语言的角色。

source: English in the late 20th century is in the fortunate position of being the lingua franca at an unusual moment.
zh_cn: 20世纪末英语幸运地在一个不寻常的时刻成为通用语言。

source: For the first time in history a global language is needed for practical purposes (by scientists, by airline pilots).
zh_cn: 有史以来第一次，（科学家和航空飞行员们）需要一种全球通用的语言用于实际应用。

source: Meanwhile a communication system is in place to spread some knowlege of the English language to a mass international audience through radio, television and the internet.
zh_cn: 同时，一个通过广播、电视和网络向全世界大量观众传播英语语言知识的通讯体系也已经准备就绪。

source: The imperial power underpinning American English as a lingua franca is for the first time cultural and economic rather than military.
zh_cn: 第一次，稳固美式英语的通用语言地位的帝国强权不再是武力，而变为了文化和经济。

source: The pattern of history insists that English is not likely to be the world's final lingua franca.
zh_cn: 历史规律注定了英语不太可能一直是世界通用语言。

source: Others will come and go.
zh_cn: 其它语言也会来来往往。

source: It is also true to say that the predominance of English depends on its spread rather than the total number speaking it.
zh_cn: 并且可以说：英语取得主导地位是靠它的使用范围取胜，而非依靠使用人数。

source: Chinese is spoken by more people than English (albeit in only one region of the world), and Chinese economic power lies in the future.
zh_cn: 说汉语的人数比英语更多（虽然汉语在全世界的一个区域被使用），而且中国的经济很有发展潜力。

source: But the complexity of Chinese perhaps makes it an unlikely rival candidate.
zh_cn: 但是汉语的复杂很可能使其不会成为竞争对手。

source: One of the great advantages of English is that it is easy to speak at a simple level, though immensely complex in its idiom.
zh_cn: 英语的一大优势就是它容易进行简单使用，尽管它的习语非常复杂。

source: New languages from old
zh_cn: 语言的推陈出新

source: Meanwhile the evolutionary processes go on.
zh_cn: 与此同时语言进化的过程依然在继续。

source: Already there are many varieties of English in use.
zh_cn: 英语在使用中已产生了许多变体。

source: The pidgin English flourishing in New Guinea is baffling to an outsider; originally devised as a practical business language, reduced to its simplest elements, it has evolved its own rich character.
zh_cn: 活跃在新几内亚的“几式”英语对于外人来说难以理解，“几式”英语最初被设计为一种实用商业语言并被简化到极致，发展出了自己丰富的特色。

source: In the same way English-speaking communities in the West Indies or in India (not to mention America) have developed local words, phrases and constructions which give their own version of the language a special colour.
zh_cn: 同样，西印度群岛或印度（更不用说美洲了）的英语群体也发展出了独具特色的方言。

source: The astonishing proliferation of Indo-European languages from one tongue, just 5000 years ago, will not be repeated in our more interconnected world.
zh_cn: 5000年前印欧语系从一个语言扩散激增的令人瞠目的景况在如今我们这个互相联系更紧密的世界已不会重现。

source: But the tendency of language to evolve continues unchecked.
zh_cn: 但语言进化的趋势仍将继续前行。
